## Join and Concatenate

##### In Pandas, join and concatenate are two important operations used to combine multiple DataFrames into one.
##### commonly used in data preprocessing and data analysis, especially when working with data from different sources.

In [1]:
# join() is used to combine two DataFrames based on the index or a key column (like SQL joins).

# You can perform:

# inner join → keeps only matching rows.(Intersection)

# outer join → keeps all rows, fills missing with NaN.(All from left)

# left join → keeps all rows from the left DataFrame.(All from Right)

# right join → keeps all rows from the right DataFrame.(Union)
#  Why use join()?
# To combine two datasets that share a common key (like "user_id", "student_id", etc.)
# 2. concat() (concatenate) in Pandas
# concat() is used to combine DataFrames vertically (stack rows) or horizontally (stack columns).

# Syntax: pd.concat([df1, df2], axis=0) for rows, axis=1 for columns.

# Why use concat()?
# To append data (like daily logs or monthly sales) or merge columns with the same or related index.

In [2]:
import pandas as pd

In [3]:
df_employees = pd.DataFrame({
  'emp-id' : [1,2,3,4],
  'name': ['Alice','Bob','Charlie','David'],
  'dept_id':['101','102','103','104']  
})

In [4]:
df_employees

   emp-id     name dept_id
0       1    Alice     101
1       2      Bob     102
2       3  Charlie     103
3       4    David     104

In [5]:
##Create Department Dataframe

In [6]:
df_departments = pd.DataFrame({
    'dept_id' : [101,102,105],
    'dept_name' : ['HR','Finance','IT']
})

In [7]:
df_departments

   dept_id dept_name
0      101        HR
1      102   Finance
2      105        IT

In [8]:
## Inner Join
pd.merge(df_employees, df_departments, on='dept_id', how='inner')

ValueError: You are trying to merge on object and int64 columns for key 'dept_id'. If you wish to proceed you should use pd.concat

In [ ]:
## Right Join

In [ ]:
pd.merge(df_employees, df_departments, on='dept_id', how='right') #Right ko table laii prirority diyera rakhxa data ie. dept_name and dept_Id here

In [ ]:
pd.merge(df_employees, df_departments, on='dept_id', how='left') # Gives priority to left table ie. emp_id and name

In [ ]:
## Full outer Join
    #Union of both tables 
pd.merge(df_employees,df_departments, on = 'dept_id', how ='outer' )

In [ ]:
## Different columns names:
df_departments.rename(columns = {'dept_id':'id'},inplace = True)

In [ ]:
df_departments

In [ ]:
## If there is no any common column in tables we use left on and right on to join the table
pd.merge(df_employees,df_departments, how = 'inner', left_on='dept_id',right_on= 'id')

In [ ]:
pd.merge(df_employees,df_departments, how = 'inner', left_on='dept_id',right_on= 'id')

#### Loc and ILoc

Used for fetching data from index

In [ ]:
#Sample DataFrame
df = pd.DataFrame({
    'Name' : ['Alice','Bob','Charlie'],
    'Age':[25,30,35]
}, index = ['a','b','c']) # Changes indexes from 0,1,2 -----> a,b,c

In [ ]:
df

loc: Label-based indexing
Uses labels (names of rows or columns).
-"l" for label.
-Includes both row labels and column labels.

In [ ]:
df.loc['a']

In [ ]:
df.loc['a','Age']

In [ ]:
df.loc['a','Name']

### iloc: Index Location (Integer-based indexing)
Uses integer positions (like Python lists).
-"i" for integer.
-Zero-based indexing.

In [ ]:
df.iloc[0]     # First row
df.iloc[2, 1]  # 3rd row, 2nd column (by position)

In [ ]:
df.iloc[0]

In [ ]:
df.iloc[0,0]

In [ ]:
df.iloc[2,1]

### Concatenate

In [ ]:
import pandas as pd

ids = [1, 2, 3, 4, 5]
product = ['Headhone', 'Mobile', 'Laptop', 'ipad', 'Airpode']
unit_price = [10000, 20000, 30000, 40000, 50000]
quantity = [10, 12, 15, 4, 3]

In [ ]:
dicts = {
    'id': ids,
    'product': product,
    'unit_price': unit_price,
    'quantity': quantity
}

In [36]:
jan = pd.DataFrame(dicts)

In [35]:
jan

   id   product  unit_price  quantity month_name
0   1  Headhone       10000        10        Jun
1   2    Mobile       20000        12        Jun
2   3    Laptop       30000        15        Jun
3   4     Watch       10000         4        Jun
4   5   Speaker       12000         3        Jun

In [30]:
jan['month_name'] = 'Jun'

In [31]:
ids = [1, 2, 3, 4, 5]
product = ['Headhone', 'Mobile', 'Laptop', 'Watch', 'Speaker']
unit_price = [10000, 20000, 30000, 10000, 12000]
quantity = [10, 12, 15, 4, 3]

In [32]:
dicts = {
    'id': ids,
    'product': product,
    'unit_price': unit_price,
    'quantity': quantity
}

In [42]:
feb = pd.DataFrame(dicts)
feb

   id   product  unit_price  quantity
0   1  Headhone       10000        10
1   2    Mobile       20000        12
2   3    Laptop       30000        15
3   4     Watch       10000         4
4   5   Speaker       12000         3

### Concatenate

In [43]:
pd.concat([jan,feb])

   id   product  unit_price  quantity month_name
0   1  Headhone       10000        10        Jun
1   2    Mobile       20000        12        Jun
2   3    Laptop       30000        15        Jun
3   4     Watch       10000         4        Jun
4   5   Speaker       12000         3        Jun
0   1  Headhone       10000        10        NaN
1   2    Mobile       20000        12        NaN
2   3    Laptop       30000        15        NaN
3   4     Watch       10000         4        NaN
4   5   Speaker       12000         3        NaN

In [44]:
total_data = pd.concat([jan , feb])

In [45]:
total_data

   id   product  unit_price  quantity month_name
0   1  Headhone       10000        10        Jun
1   2    Mobile       20000        12        Jun
2   3    Laptop       30000        15        Jun
3   4     Watch       10000         4        Jun
4   5   Speaker       12000         3        Jun
0   1  Headhone       10000        10        NaN
1   2    Mobile       20000        12        NaN
2   3    Laptop       30000        15        NaN
3   4     Watch       10000         4        NaN
4   5   Speaker       12000         3        NaN